0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];
internalField   uniform 3.7733647e-04;   // example value (see note below)
boundaryField
{
    wall-2d_v0_boss-extrude1
    {
        type            empty;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 3.7733647e-04;   // example
    }

    outlet
    {
        type            zeroGradient;
    }

    outerwall
    {
        type            epsilonWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
