0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00375;

boundaryField
{

    wall-2d_v0_boss-extrude1
    {
        type            empty;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 0.00375;    // k = 1.5*(U*I)^2 ; example U=1 m/s, I=0.05
    }

    outlet
    {
        type            zeroGradient;
    }

    outerwall
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
