0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 3.35410197e-03;   // example value (see note below)
boundaryField
{
    wall-2d_v0_boss-extrude1
    {
        type            empty;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 3.35410197e-03;  // nu_t ≈ C_mu * k^2 / epsilon (example)
    }

    outlet
    {
        type            zeroGradient;
    }

    outerwall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}



// ************************************************************************* //
